apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_LCD_CAM_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_LCD_CAM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* LCD_CAM_LCD_CLOCK_REG register
 * LCD clock register
 */

#define LCD_CAM_LCD_CLOCK_REG (DR_REG_LCD_CAM_BASE + 0x0)

/* LCD_CAM_CLK_EN : R/W; bitpos: [31]; default: 0;
 * Set this bit to enable clk gate
 */

#define LCD_CAM_CLK_EN    (BIT(31))
#define LCD_CAM_CLK_EN_M  (LCD_CAM_CLK_EN_V << LCD_CAM_CLK_EN_S)
#define LCD_CAM_CLK_EN_V  0x00000001
#define LCD_CAM_CLK_EN_S  31

/* LCD_CAM_LCD_CLK_SEL : R/W; bitpos: [30:29]; default: 0;
 * Select LCD module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no
 * clock.
 */

#define LCD_CAM_LCD_CLK_SEL    0x00000003
#define LCD_CAM_LCD_CLK_SEL_M  (LCD_CAM_LCD_CLK_SEL_V << LCD_CAM_LCD_CLK_SEL_S)
#define LCD_CAM_LCD_CLK_SEL_V  0x00000003
#define LCD_CAM_LCD_CLK_SEL_S  29

/* LCD_CAM_LCD_CLKM_DIV_A : R/W; bitpos: [28:23]; default: 0;
 * Fractional clock divider denominator value
 */

#define LCD_CAM_LCD_CLKM_DIV_A    0x0000003f
#define LCD_CAM_LCD_CLKM_DIV_A_M  (LCD_CAM_LCD_CLKM_DIV_A_V << LCD_CAM_LCD_CLKM_DIV_A_S)
#define LCD_CAM_LCD_CLKM_DIV_A_V  0x0000003f
#define LCD_CAM_LCD_CLKM_DIV_A_S  23

/* LCD_CAM_LCD_CLKM_DIV_B : R/W; bitpos: [22:17]; default: 0;
 * Fractional clock divider numerator value
 */

#define LCD_CAM_LCD_CLKM_DIV_B    0x0000003f
#define LCD_CAM_LCD_CLKM_DIV_B_M  (LCD_CAM_LCD_CLKM_DIV_B_V << LCD_CAM_LCD_CLKM_DIV_B_S)
#define LCD_CAM_LCD_CLKM_DIV_B_V  0x0000003f
#define LCD_CAM_LCD_CLKM_DIV_B_S  17

/* LCD_CAM_LCD_CLKM_DIV_NUM : R/W; bitpos: [16:9]; default: 4;
 * Integral LCD clock divider value
 */

#define LCD_CAM_LCD_CLKM_DIV_NUM    0x000000ff
#define LCD_CAM_LCD_CLKM_DIV_NUM_M  (LCD_CAM_LCD_CLKM_DIV_NUM_V << LCD_CAM_LCD_CLKM_DIV_NUM_S)
#define LCD_CAM_LCD_CLKM_DIV_NUM_V  0x000000ff
#define LCD_CAM_LCD_CLKM_DIV_NUM_S  9

/* LCD_CAM_LCD_CK_OUT_EDGE : R/W; bitpos: [8]; default: 0;
 * 1: LCD_PCLK high in first half clock cycle. 0: LCD_PCLK low in first half
 * clock cycle.
 */

#define LCD_CAM_LCD_CK_OUT_EDGE    (BIT(8))
#define LCD_CAM_LCD_CK_OUT_EDGE_M  (LCD_CAM_LCD_CK_OUT_EDGE_V << LCD_CAM_LCD_CK_OUT_EDGE_S)
#define LCD_CAM_LCD_CK_OUT_EDGE_V  0x00000001
#define LCD_CAM_LCD_CK_OUT_EDGE_S  8

/* LCD_CAM_LCD_CK_IDLE_EDGE : R/W; bitpos: [7]; default: 0;
 * 1: LCD_PCLK line is high when idle     0: LCD_PCLK line is low when idle.
 */

#define LCD_CAM_LCD_CK_IDLE_EDGE    (BIT(7))
#define LCD_CAM_LCD_CK_IDLE_EDGE_M  (LCD_CAM_LCD_CK_IDLE_EDGE_V << LCD_CAM_LCD_CK_IDLE_EDGE_S)
#define LCD_CAM_LCD_CK_IDLE_EDGE_V  0x00000001
#define LCD_CAM_LCD_CK_IDLE_EDGE_S  7

/* LCD_CAM_LCD_CLK_EQU_SYSCLK : R/W; bitpos: [6]; default: 1;
 * 1: f_LCD_PCLK = f_LCD_CLK. 0: f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1).
 */

#define LCD_CAM_LCD_CLK_EQU_SYSCLK    (BIT(6))
#define LCD_CAM_LCD_CLK_EQU_SYSCLK_M  (LCD_CAM_LCD_CLK_EQU_SYSCLK_V << LCD_CAM_LCD_CLK_EQU_SYSCLK_S)
#define LCD_CAM_LCD_CLK_EQU_SYSCLK_V  0x00000001
#define LCD_CAM_LCD_CLK_EQU_SYSCLK_S  6

/* LCD_CAM_LCD_CLKCNT_N : R/W; bitpos: [5:0]; default: 3;
 * f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1) when reg_clk_equ_sysclk is 0.
 */

#define LCD_CAM_LCD_CLKCNT_N    0x0000003f
#define LCD_CAM_LCD_CLKCNT_N_M  (LCD_CAM_LCD_CLKCNT_N_V << LCD_CAM_LCD_CLKCNT_N_S)
#define LCD_CAM_LCD_CLKCNT_N_V  0x0000003f
#define LCD_CAM_LCD_CLKCNT_N_S  0

/* LCD_CAM_CAM_CTRL_REG register
 * Camera configuration register
 */

#define LCD_CAM_CAM_CTRL_REG (DR_REG_LCD_CAM_BASE + 0x4)

/* LCD_CAM_CAM_CLK_SEL : R/W; bitpos: [30:29]; default: 0;
 * Select Camera module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no
 * clock.
 */

#define LCD_CAM_CAM_CLK_SEL    0x00000003
#define LCD_CAM_CAM_CLK_SEL_M  (LCD_CAM_CAM_CLK_SEL_V << LCD_CAM_CAM_CLK_SEL_S)
#define LCD_CAM_CAM_CLK_SEL_V  0x00000003
#define LCD_CAM_CAM_CLK_SEL_S  29

/* LCD_CAM_CAM_CLKM_DIV_A : R/W; bitpos: [28:23]; default: 0;
 * Fractional clock divider denominator value
 */

#define LCD_CAM_CAM_CLKM_DIV_A    0x0000003f
#define LCD_CAM_CAM_CLKM_DIV_A_M  (LCD_CAM_CAM_CLKM_DIV_A_V << LCD_CAM_CAM_CLKM_DIV_A_S)
#define LCD_CAM_CAM_CLKM_DIV_A_V  0x0000003f
#define LCD_CAM_CAM_CLKM_DIV_A_S  23

/* LCD_CAM_CAM_CLKM_DIV_B : R/W; bitpos: [22:17]; default: 0;
 * Fractional clock divider numerator value
 */

#define LCD_CAM_CAM_CLKM_DIV_B    0x0000003f
#define LCD_CAM_CAM_CLKM_DIV_B_M  (LCD_CAM_CAM_CLKM_DIV_B_V << LCD_CAM_CAM_CLKM_DIV_B_S)
#define LCD_CAM_CAM_CLKM_DIV_B_V  0x0000003f
#define LCD_CAM_CAM_CLKM_DIV_B_S  17

/* LCD_CAM_CAM_CLKM_DIV_NUM : R/W; bitpos: [16:9]; default: 4;
 * Integral Camera clock divider value
 */

#define LCD_CAM_CAM_CLKM_DIV_NUM    0x000000ff
#define LCD_CAM_CAM_CLKM_DIV_NUM_M  (LCD_CAM_CAM_CLKM_DIV_NUM_V << LCD_CAM_CAM_CLKM_DIV_NUM_S)
#define LCD_CAM_CAM_CLKM_DIV_NUM_V  0x000000ff
#define LCD_CAM_CAM_CLKM_DIV_NUM_S  9

/* LCD_CAM_CAM_VS_EOF_EN : R/W; bitpos: [8]; default: 0;
 * 1: CAM_VSYNC to generate in_suc_eof. 0: in_suc_eof is controlled by
 * reg_cam_rec_data_cyclelen.
 */

#define LCD_CAM_CAM_VS_EOF_EN    (BIT(8))
#define LCD_CAM_CAM_VS_EOF_EN_M  (LCD_CAM_CAM_VS_EOF_EN_V << LCD_CAM_CAM_VS_EOF_EN_S)
#define LCD_CAM_CAM_VS_EOF_EN_V  0x00000001
#define LCD_CAM_CAM_VS_EOF_EN_S  8

