apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/* LCD_CAM_CAM_LINE_INT_EN : R/W; bitpos: [7]; default: 0;
 * 1: Enable to generate CAM_HS_INT. 0: Disable.
 */

#define LCD_CAM_CAM_LINE_INT_EN    (BIT(7))
#define LCD_CAM_CAM_LINE_INT_EN_M  (LCD_CAM_CAM_LINE_INT_EN_V << LCD_CAM_CAM_LINE_INT_EN_S)
#define LCD_CAM_CAM_LINE_INT_EN_V  0x00000001
#define LCD_CAM_CAM_LINE_INT_EN_S  7

/* LCD_CAM_CAM_BIT_ORDER : R/W; bitpos: [6]; default: 0;
 * 1: invert data byte order, only valid in 2 byte mode. 0: Not change.
 */

#define LCD_CAM_CAM_BIT_ORDER    (BIT(6))
#define LCD_CAM_CAM_BIT_ORDER_M  (LCD_CAM_CAM_BIT_ORDER_V << LCD_CAM_CAM_BIT_ORDER_S)
#define LCD_CAM_CAM_BIT_ORDER_V  0x00000001
#define LCD_CAM_CAM_BIT_ORDER_S  6

/* LCD_CAM_CAM_BYTE_ORDER : R/W; bitpos: [5]; default: 0;
 * 1: Change data bit order, change CAM_DATA_in[7:0] to CAM_DATA_in[0:7] in
 * one byte mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not
 * change.
 */

#define LCD_CAM_CAM_BYTE_ORDER    (BIT(5))
#define LCD_CAM_CAM_BYTE_ORDER_M  (LCD_CAM_CAM_BYTE_ORDER_V << LCD_CAM_CAM_BYTE_ORDER_S)
#define LCD_CAM_CAM_BYTE_ORDER_V  0x00000001
#define LCD_CAM_CAM_BYTE_ORDER_S  5

/* LCD_CAM_CAM_UPDATE_REG : R/W; bitpos: [4]; default: 0;
 * 1: Update Camera registers, will be cleared by hardware. 0 : Not care.
 */

#define LCD_CAM_CAM_UPDATE_REG    (BIT(4))
#define LCD_CAM_CAM_UPDATE_REG_M  (LCD_CAM_CAM_UPDATE_REG_V << LCD_CAM_CAM_UPDATE_REG_S)
#define LCD_CAM_CAM_UPDATE_REG_V  0x00000001
#define LCD_CAM_CAM_UPDATE_REG_S  4

/* LCD_CAM_CAM_VSYNC_FILTER_THRES : R/W; bitpos: [3:1]; default: 0;
 * Filter threshold value for CAM_VSYNC signal.
 */

#define LCD_CAM_CAM_VSYNC_FILTER_THRES    0x00000007
#define LCD_CAM_CAM_VSYNC_FILTER_THRES_M  (LCD_CAM_CAM_VSYNC_FILTER_THRES_V << LCD_CAM_CAM_VSYNC_FILTER_THRES_S)
#define LCD_CAM_CAM_VSYNC_FILTER_THRES_V  0x00000007
#define LCD_CAM_CAM_VSYNC_FILTER_THRES_S  1

/* LCD_CAM_CAM_STOP_EN : R/W; bitpos: [0]; default: 0;
 * Camera stop enable signal, 1: camera stops when DMA Rx FIFO is full. 0:
 * Not stop.
 */

#define LCD_CAM_CAM_STOP_EN    (BIT(0))
#define LCD_CAM_CAM_STOP_EN_M  (LCD_CAM_CAM_STOP_EN_V << LCD_CAM_CAM_STOP_EN_S)
#define LCD_CAM_CAM_STOP_EN_V  0x00000001
#define LCD_CAM_CAM_STOP_EN_S  0

/* LCD_CAM_CAM_CTRL1_REG register
 * Camera configuration register
 */

#define LCD_CAM_CAM_CTRL1_REG (DR_REG_LCD_CAM_BASE + 0x8)

/* LCD_CAM_CAM_AFIFO_RESET : WO; bitpos: [31]; default: 0;
 * Camera AFIFO reset signal.
 */

#define LCD_CAM_CAM_AFIFO_RESET    (BIT(31))
#define LCD_CAM_CAM_AFIFO_RESET_M  (LCD_CAM_CAM_AFIFO_RESET_V << LCD_CAM_CAM_AFIFO_RESET_S)
#define LCD_CAM_CAM_AFIFO_RESET_V  0x00000001
#define LCD_CAM_CAM_AFIFO_RESET_S  31

/* LCD_CAM_CAM_RESET : WO; bitpos: [30]; default: 0;
 * Camera module reset signal.
 */

#define LCD_CAM_CAM_RESET    (BIT(30))
#define LCD_CAM_CAM_RESET_M  (LCD_CAM_CAM_RESET_V << LCD_CAM_CAM_RESET_S)
#define LCD_CAM_CAM_RESET_V  0x00000001
#define LCD_CAM_CAM_RESET_S  30

/* LCD_CAM_CAM_START : R/W; bitpos: [29]; default: 0;
 * Camera module start signal.
 */

#define LCD_CAM_CAM_START    (BIT(29))
#define LCD_CAM_CAM_START_M  (LCD_CAM_CAM_START_V << LCD_CAM_CAM_START_S)
#define LCD_CAM_CAM_START_V  0x00000001
#define LCD_CAM_CAM_START_S  29

/* LCD_CAM_CAM_VH_DE_MODE_EN : R/W; bitpos: [28]; default: 0;
 * 1: Input control signals are CAM_DE CAM_HSYNC and CAM_VSYNC is 1. 0:
 * Input control signals are CAM_DE and CAM_VSYNC. CAM_HSYNC and CAM_DE are
 * all 1 the same time.
 */

#define LCD_CAM_CAM_VH_DE_MODE_EN    (BIT(28))
#define LCD_CAM_CAM_VH_DE_MODE_EN_M  (LCD_CAM_CAM_VH_DE_MODE_EN_V << LCD_CAM_CAM_VH_DE_MODE_EN_S)
#define LCD_CAM_CAM_VH_DE_MODE_EN_V  0x00000001
#define LCD_CAM_CAM_VH_DE_MODE_EN_S  28

/* LCD_CAM_CAM_VSYNC_INV : R/W; bitpos: [27]; default: 0;
 * CAM_VSYNC invert enable signal, valid in high level.
 */

#define LCD_CAM_CAM_VSYNC_INV    (BIT(27))
#define LCD_CAM_CAM_VSYNC_INV_M  (LCD_CAM_CAM_VSYNC_INV_V << LCD_CAM_CAM_VSYNC_INV_S)
#define LCD_CAM_CAM_VSYNC_INV_V  0x00000001
#define LCD_CAM_CAM_VSYNC_INV_S  27

/* LCD_CAM_CAM_HSYNC_INV : R/W; bitpos: [26]; default: 0;
 * CAM_HSYNC invert enable signal, valid in high level.
 */

#define LCD_CAM_CAM_HSYNC_INV    (BIT(26))
#define LCD_CAM_CAM_HSYNC_INV_M  (LCD_CAM_CAM_HSYNC_INV_V << LCD_CAM_CAM_HSYNC_INV_S)
#define LCD_CAM_CAM_HSYNC_INV_V  0x00000001
#define LCD_CAM_CAM_HSYNC_INV_S  26

/* LCD_CAM_CAM_DE_INV : R/W; bitpos: [25]; default: 0;
 * CAM_DE invert enable signal, valid in high level.
 */

#define LCD_CAM_CAM_DE_INV    (BIT(25))
#define LCD_CAM_CAM_DE_INV_M  (LCD_CAM_CAM_DE_INV_V << LCD_CAM_CAM_DE_INV_S)
#define LCD_CAM_CAM_DE_INV_V  0x00000001
#define LCD_CAM_CAM_DE_INV_S  25

/* LCD_CAM_CAM_2BYTE_EN : R/W; bitpos: [24]; default: 0;
 * 1: The bit number of input data is 9~16.  0: The bit number of input data
 * is 0~8.
 */

#define LCD_CAM_CAM_2BYTE_EN    (BIT(24))
#define LCD_CAM_CAM_2BYTE_EN_M  (LCD_CAM_CAM_2BYTE_EN_V << LCD_CAM_CAM_2BYTE_EN_S)
#define LCD_CAM_CAM_2BYTE_EN_V  0x00000001
#define LCD_CAM_CAM_2BYTE_EN_S  24

/* LCD_CAM_CAM_VSYNC_FILTER_EN : R/W; bitpos: [23]; default: 0;
 * 1: Enable CAM_VSYNC filter function. 0: bypass.
 */

#define LCD_CAM_CAM_VSYNC_FILTER_EN    (BIT(23))
#define LCD_CAM_CAM_VSYNC_FILTER_EN_M  (LCD_CAM_CAM_VSYNC_FILTER_EN_V << LCD_CAM_CAM_VSYNC_FILTER_EN_S)
#define LCD_CAM_CAM_VSYNC_FILTER_EN_V  0x00000001
#define LCD_CAM_CAM_VSYNC_FILTER_EN_S  23

/* LCD_CAM_CAM_CLK_INV : R/W; bitpos: [22]; default: 0;
 * 1: Invert  the input signal CAM_PCLK. 0: Not invert.
 */

#define LCD_CAM_CAM_CLK_INV    (BIT(22))
#define LCD_CAM_CAM_CLK_INV_M  (LCD_CAM_CAM_CLK_INV_V << LCD_CAM_CAM_CLK_INV_S)
#define LCD_CAM_CAM_CLK_INV_V  0x00000001
#define LCD_CAM_CAM_CLK_INV_S  22

/* LCD_CAM_CAM_LINE_INT_NUM : R/W; bitpos: [21:16]; default: 0;
 * The line number minus 1 to generate cam_hs_int.
 */

#define LCD_CAM_CAM_LINE_INT_NUM    0x0000003f
#define LCD_CAM_CAM_LINE_INT_NUM_M  (LCD_CAM_CAM_LINE_INT_NUM_V << LCD_CAM_CAM_LINE_INT_NUM_S)
#define LCD_CAM_CAM_LINE_INT_NUM_V  0x0000003f
#define LCD_CAM_CAM_LINE_INT_NUM_S  16

/* LCD_CAM_CAM_REC_DATA_BYTELEN : R/W; bitpos: [15:0]; default: 0;
 * Camera receive data byte length minus 1 to set DMA in_suc_eof_int.
 */

