apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/* LCD_CAM_LCD_CONV_YUV_MODE : R/W; bitpos: [25:24]; default: 0;
 * 0: yuv422. 1: yuv420. 2: yuv411. When in yuv2yuv mode, yuv_mode decides
 * the yuv mode of Data_in
 */

#define LCD_CAM_LCD_CONV_YUV_MODE    0x00000003
#define LCD_CAM_LCD_CONV_YUV_MODE_M  (LCD_CAM_LCD_CONV_YUV_MODE_V << LCD_CAM_LCD_CONV_YUV_MODE_S)
#define LCD_CAM_LCD_CONV_YUV_MODE_V  0x00000003
#define LCD_CAM_LCD_CONV_YUV_MODE_S  24

/* LCD_CAM_LCD_CONV_YUV2YUV_MODE : R/W; bitpos: [23:22]; default: 3;
 * 0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv
 * mode, trans_mode must be set to 1.
 */

#define LCD_CAM_LCD_CONV_YUV2YUV_MODE    0x00000003
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE_M  (LCD_CAM_LCD_CONV_YUV2YUV_MODE_V << LCD_CAM_LCD_CONV_YUV2YUV_MODE_S)
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE_V  0x00000003
#define LCD_CAM_LCD_CONV_YUV2YUV_MODE_S  22

/* LCD_CAM_LCD_CONV_TXTORX : R/W; bitpos: [21]; default: 0;
 * 0: txtorx mode off. 1: txtorx mode on.
 */

#define LCD_CAM_LCD_CONV_TXTORX    (BIT(21))
#define LCD_CAM_LCD_CONV_TXTORX_M  (LCD_CAM_LCD_CONV_TXTORX_V << LCD_CAM_LCD_CONV_TXTORX_S)
#define LCD_CAM_LCD_CONV_TXTORX_V  0x00000001
#define LCD_CAM_LCD_CONV_TXTORX_S  21

/* LCD_CAM_LCD_CONV_8BITS_DATA_INV : R/W; bitpos: [20]; default: 0;
 * 1:invert every two 8bits input data. 2. disabled.
 */

#define LCD_CAM_LCD_CONV_8BITS_DATA_INV    (BIT(20))
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV_M  (LCD_CAM_LCD_CONV_8BITS_DATA_INV_V << LCD_CAM_LCD_CONV_8BITS_DATA_INV_S)
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV_V  0x00000001
#define LCD_CAM_LCD_CONV_8BITS_DATA_INV_S  20

/* LCD_CAM_LCD_USER_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_USER_REG (DR_REG_LCD_CAM_BASE + 0x14)

/* LCD_CAM_LCD_CMD_2_CYCLE_EN : R/W; bitpos: [31]; default: 0;
 * The cycle length of command phase.  1: 2 cycles. 0: 1 cycle.
 */

#define LCD_CAM_LCD_CMD_2_CYCLE_EN    (BIT(31))
#define LCD_CAM_LCD_CMD_2_CYCLE_EN_M  (LCD_CAM_LCD_CMD_2_CYCLE_EN_V << LCD_CAM_LCD_CMD_2_CYCLE_EN_S)
#define LCD_CAM_LCD_CMD_2_CYCLE_EN_V  0x00000001
#define LCD_CAM_LCD_CMD_2_CYCLE_EN_S  31

/* LCD_CAM_LCD_DUMMY_CYCLELEN : R/W; bitpos: [30:29]; default: 0;
 * The dummy cycle length minus 1.
 */

#define LCD_CAM_LCD_DUMMY_CYCLELEN    0x00000003
#define LCD_CAM_LCD_DUMMY_CYCLELEN_M  (LCD_CAM_LCD_DUMMY_CYCLELEN_V << LCD_CAM_LCD_DUMMY_CYCLELEN_S)
#define LCD_CAM_LCD_DUMMY_CYCLELEN_V  0x00000003
#define LCD_CAM_LCD_DUMMY_CYCLELEN_S  29

/* LCD_CAM_LCD_RESET : WO; bitpos: [28]; default: 0;
 * The value of  command.
 */

#define LCD_CAM_LCD_RESET    (BIT(28))
#define LCD_CAM_LCD_RESET_M  (LCD_CAM_LCD_RESET_V << LCD_CAM_LCD_RESET_S)
#define LCD_CAM_LCD_RESET_V  0x00000001
#define LCD_CAM_LCD_RESET_S  28

/* LCD_CAM_LCD_START : R/W; bitpos: [27]; default: 0;
 * LCD start sending data enable signal, valid in high level.
 */

#define LCD_CAM_LCD_START    (BIT(27))
#define LCD_CAM_LCD_START_M  (LCD_CAM_LCD_START_V << LCD_CAM_LCD_START_S)
#define LCD_CAM_LCD_START_V  0x00000001
#define LCD_CAM_LCD_START_S  27

/* LCD_CAM_LCD_CMD : R/W; bitpos: [26]; default: 0;
 * 1: Be able to send command in LCD sequence when LCD starts. 0: Disable.
 */

#define LCD_CAM_LCD_CMD    (BIT(26))
#define LCD_CAM_LCD_CMD_M  (LCD_CAM_LCD_CMD_V << LCD_CAM_LCD_CMD_S)
#define LCD_CAM_LCD_CMD_V  0x00000001
#define LCD_CAM_LCD_CMD_S  26

/* LCD_CAM_LCD_DUMMY : R/W; bitpos: [25]; default: 0;
 * 1: Enable DUMMY phase in LCD sequence when LCD starts. 0: Disable.
 */

#define LCD_CAM_LCD_DUMMY    (BIT(25))
#define LCD_CAM_LCD_DUMMY_M  (LCD_CAM_LCD_DUMMY_V << LCD_CAM_LCD_DUMMY_S)
#define LCD_CAM_LCD_DUMMY_V  0x00000001
#define LCD_CAM_LCD_DUMMY_S  25

/* LCD_CAM_LCD_DOUT : R/W; bitpos: [24]; default: 0;
 * 1: Be able to send data out in LCD sequence when LCD starts. 0: Disable.
 */

#define LCD_CAM_LCD_DOUT    (BIT(24))
#define LCD_CAM_LCD_DOUT_M  (LCD_CAM_LCD_DOUT_V << LCD_CAM_LCD_DOUT_S)
#define LCD_CAM_LCD_DOUT_V  0x00000001
#define LCD_CAM_LCD_DOUT_S  24

/* LCD_CAM_LCD_2BYTE_EN : R/W; bitpos: [23]; default: 0;
 * 1: The bit number of output LCD data is 9~16.  0: The bit number of
 * output LCD data is 0~8.
 */

#define LCD_CAM_LCD_2BYTE_EN    (BIT(23))
#define LCD_CAM_LCD_2BYTE_EN_M  (LCD_CAM_LCD_2BYTE_EN_V << LCD_CAM_LCD_2BYTE_EN_S)
#define LCD_CAM_LCD_2BYTE_EN_V  0x00000001
#define LCD_CAM_LCD_2BYTE_EN_S  23

/* LCD_CAM_LCD_BYTE_ORDER : R/W; bitpos: [22]; default: 0;
 * 1: invert data byte order, only valid in 2 byte mode. 0: Not change.
 */

#define LCD_CAM_LCD_BYTE_ORDER    (BIT(22))
#define LCD_CAM_LCD_BYTE_ORDER_M  (LCD_CAM_LCD_BYTE_ORDER_V << LCD_CAM_LCD_BYTE_ORDER_S)
#define LCD_CAM_LCD_BYTE_ORDER_V  0x00000001
#define LCD_CAM_LCD_BYTE_ORDER_S  22

/* LCD_CAM_LCD_BIT_ORDER : R/W; bitpos: [21]; default: 0;
 * 1: Change data bit order, change LCD_DATA_out[7:0] to LCD_DATA_out[0:7]
 * in one byte mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not
 * change.
 */

#define LCD_CAM_LCD_BIT_ORDER    (BIT(21))
#define LCD_CAM_LCD_BIT_ORDER_M  (LCD_CAM_LCD_BIT_ORDER_V << LCD_CAM_LCD_BIT_ORDER_S)
#define LCD_CAM_LCD_BIT_ORDER_V  0x00000001
#define LCD_CAM_LCD_BIT_ORDER_S  21

/* LCD_CAM_LCD_UPDATE_REG : R/W; bitpos: [20]; default: 0;
 * 1: Update LCD registers, will be cleared by hardware. 0 : Not care.
 */

#define LCD_CAM_LCD_UPDATE_REG    (BIT(20))
#define LCD_CAM_LCD_UPDATE_REG_M  (LCD_CAM_LCD_UPDATE_REG_V << LCD_CAM_LCD_UPDATE_REG_S)
#define LCD_CAM_LCD_UPDATE_REG_V  0x00000001
#define LCD_CAM_LCD_UPDATE_REG_S  20

/* LCD_CAM_LCD_8BITS_ORDER : R/W; bitpos: [19]; default: 0;
 * 1: invert every two data byte, valid in 1 byte mode. 0: Not change.
 */

#define LCD_CAM_LCD_8BITS_ORDER    (BIT(19))
#define LCD_CAM_LCD_8BITS_ORDER_M  (LCD_CAM_LCD_8BITS_ORDER_V << LCD_CAM_LCD_8BITS_ORDER_S)
#define LCD_CAM_LCD_8BITS_ORDER_V  0x00000001
#define LCD_CAM_LCD_8BITS_ORDER_S  19

/* LCD_CAM_LCD_ALWAYS_OUT_EN : R/W; bitpos: [13]; default: 0;
 * LCD always output when LCD is in LCD_DOUT state, unless reg_lcd_start is
 * cleared or reg_lcd_reset is set.
 */

#define LCD_CAM_LCD_ALWAYS_OUT_EN    (BIT(13))
#define LCD_CAM_LCD_ALWAYS_OUT_EN_M  (LCD_CAM_LCD_ALWAYS_OUT_EN_V << LCD_CAM_LCD_ALWAYS_OUT_EN_S)
#define LCD_CAM_LCD_ALWAYS_OUT_EN_V  0x00000001
#define LCD_CAM_LCD_ALWAYS_OUT_EN_S  13

