apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/* LCD_CAM_LCD_DOUT_CYCLELEN : R/W; bitpos: [12:0]; default: 1;
 * The output data cycles minus 1 of LCD module.
 */

#define LCD_CAM_LCD_DOUT_CYCLELEN    0x00001fff
#define LCD_CAM_LCD_DOUT_CYCLELEN_M  (LCD_CAM_LCD_DOUT_CYCLELEN_V << LCD_CAM_LCD_DOUT_CYCLELEN_S)
#define LCD_CAM_LCD_DOUT_CYCLELEN_V  0x00001fff
#define LCD_CAM_LCD_DOUT_CYCLELEN_S  0

/* LCD_CAM_LCD_MISC_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_MISC_REG (DR_REG_LCD_CAM_BASE + 0x18)

/* LCD_CAM_LCD_CD_IDLE_EDGE : R/W; bitpos: [31]; default: 0;
 * The default value of LCD_CD.
 */

#define LCD_CAM_LCD_CD_IDLE_EDGE    (BIT(31))
#define LCD_CAM_LCD_CD_IDLE_EDGE_M  (LCD_CAM_LCD_CD_IDLE_EDGE_V << LCD_CAM_LCD_CD_IDLE_EDGE_S)
#define LCD_CAM_LCD_CD_IDLE_EDGE_V  0x00000001
#define LCD_CAM_LCD_CD_IDLE_EDGE_S  31

/* LCD_CAM_LCD_CD_CMD_SET : R/W; bitpos: [30]; default: 0;
 * 1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_CMD state.  0:
 * LCD_CD = reg_cd_idle_edge.
 */

#define LCD_CAM_LCD_CD_CMD_SET    (BIT(30))
#define LCD_CAM_LCD_CD_CMD_SET_M  (LCD_CAM_LCD_CD_CMD_SET_V << LCD_CAM_LCD_CD_CMD_SET_S)
#define LCD_CAM_LCD_CD_CMD_SET_V  0x00000001
#define LCD_CAM_LCD_CD_CMD_SET_S  30

/* LCD_CAM_LCD_CD_DUMMY_SET : R/W; bitpos: [29]; default: 0;
 * 1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_DUMMY state.  0:
 * LCD_CD = reg_cd_idle_edge.
 */

#define LCD_CAM_LCD_CD_DUMMY_SET    (BIT(29))
#define LCD_CAM_LCD_CD_DUMMY_SET_M  (LCD_CAM_LCD_CD_DUMMY_SET_V << LCD_CAM_LCD_CD_DUMMY_SET_S)
#define LCD_CAM_LCD_CD_DUMMY_SET_V  0x00000001
#define LCD_CAM_LCD_CD_DUMMY_SET_S  29

/* LCD_CAM_LCD_CD_DATA_SET : R/W; bitpos: [28]; default: 0;
 * 1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_DOUT state.  0:
 * LCD_CD = reg_cd_idle_edge.
 */

#define LCD_CAM_LCD_CD_DATA_SET    (BIT(28))
#define LCD_CAM_LCD_CD_DATA_SET_M  (LCD_CAM_LCD_CD_DATA_SET_V << LCD_CAM_LCD_CD_DATA_SET_S)
#define LCD_CAM_LCD_CD_DATA_SET_V  0x00000001
#define LCD_CAM_LCD_CD_DATA_SET_S  28

/* LCD_CAM_LCD_AFIFO_RESET : WO; bitpos: [27]; default: 0;
 * LCD AFIFO reset signal.
 */

#define LCD_CAM_LCD_AFIFO_RESET    (BIT(27))
#define LCD_CAM_LCD_AFIFO_RESET_M  (LCD_CAM_LCD_AFIFO_RESET_V << LCD_CAM_LCD_AFIFO_RESET_S)
#define LCD_CAM_LCD_AFIFO_RESET_V  0x00000001
#define LCD_CAM_LCD_AFIFO_RESET_S  27

/* LCD_CAM_LCD_BK_EN : R/W; bitpos: [26]; default: 0;
 * 1: Enable blank region when LCD sends data out. 0: No blank region.
 */

#define LCD_CAM_LCD_BK_EN    (BIT(26))
#define LCD_CAM_LCD_BK_EN_M  (LCD_CAM_LCD_BK_EN_V << LCD_CAM_LCD_BK_EN_S)
#define LCD_CAM_LCD_BK_EN_V  0x00000001
#define LCD_CAM_LCD_BK_EN_S  26

/* LCD_CAM_LCD_NEXT_FRAME_EN : R/W; bitpos: [25]; default: 0;
 * 1: Send the next frame data when the current frame is sent out. 0: LCD
 * stops when the current frame is sent out.
 */

#define LCD_CAM_LCD_NEXT_FRAME_EN    (BIT(25))
#define LCD_CAM_LCD_NEXT_FRAME_EN_M  (LCD_CAM_LCD_NEXT_FRAME_EN_V << LCD_CAM_LCD_NEXT_FRAME_EN_S)
#define LCD_CAM_LCD_NEXT_FRAME_EN_V  0x00000001
#define LCD_CAM_LCD_NEXT_FRAME_EN_S  25

/* LCD_CAM_LCD_VBK_CYCLELEN : R/W; bitpos: [24:12]; default: 0;
 * The vertical back blank region cycle length minus 1 in LCD RGB mode, or
 * the hold time cycle length in LCD non-RGB mode.
 */

#define LCD_CAM_LCD_VBK_CYCLELEN    0x00001fff
#define LCD_CAM_LCD_VBK_CYCLELEN_M  (LCD_CAM_LCD_VBK_CYCLELEN_V << LCD_CAM_LCD_VBK_CYCLELEN_S)
#define LCD_CAM_LCD_VBK_CYCLELEN_V  0x00001fff
#define LCD_CAM_LCD_VBK_CYCLELEN_S  12

/* LCD_CAM_LCD_VFK_CYCLELEN : R/W; bitpos: [11:6]; default: 3;
 * The setup cycle length minus 1 in LCD non-RGB mode.
 */

#define LCD_CAM_LCD_VFK_CYCLELEN    0x0000003f
#define LCD_CAM_LCD_VFK_CYCLELEN_M  (LCD_CAM_LCD_VFK_CYCLELEN_V << LCD_CAM_LCD_VFK_CYCLELEN_S)
#define LCD_CAM_LCD_VFK_CYCLELEN_V  0x0000003f
#define LCD_CAM_LCD_VFK_CYCLELEN_S  6

/* LCD_CAM_LCD_AFIFO_THRESHOLD_NUM : R/W; bitpos: [5:1]; default: 11;
 * The awful threshold number of lcd_afifo.
 */

#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM    0x0000001f
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_M  (LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_V << LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_S)
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_V  0x0000001f
#define LCD_CAM_LCD_AFIFO_THRESHOLD_NUM_S  1

/* LCD_CAM_LCD_CTRL_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_CTRL_REG (DR_REG_LCD_CAM_BASE + 0x1c)

/* LCD_CAM_LCD_RGB_MODE_EN : R/W; bitpos: [31]; default: 0;
 * 1: Enable reg mode input vsync, hsync, de. 0: Disable.
 */

#define LCD_CAM_LCD_RGB_MODE_EN    (BIT(31))
#define LCD_CAM_LCD_RGB_MODE_EN_M  (LCD_CAM_LCD_RGB_MODE_EN_V << LCD_CAM_LCD_RGB_MODE_EN_S)
#define LCD_CAM_LCD_RGB_MODE_EN_V  0x00000001
#define LCD_CAM_LCD_RGB_MODE_EN_S  31

/* LCD_CAM_LCD_VT_HEIGHT : R/W; bitpos: [30:21]; default: 0;
 * It is the vertical total height of a frame.
 */

#define LCD_CAM_LCD_VT_HEIGHT    0x000003ff
#define LCD_CAM_LCD_VT_HEIGHT_M  (LCD_CAM_LCD_VT_HEIGHT_V << LCD_CAM_LCD_VT_HEIGHT_S)
#define LCD_CAM_LCD_VT_HEIGHT_V  0x000003ff
#define LCD_CAM_LCD_VT_HEIGHT_S  21

/* LCD_CAM_LCD_VA_HEIGHT : R/W; bitpos: [20:11]; default: 0;
 * It is the vertical active height of a frame.
 */

#define LCD_CAM_LCD_VA_HEIGHT    0x000003ff
#define LCD_CAM_LCD_VA_HEIGHT_M  (LCD_CAM_LCD_VA_HEIGHT_V << LCD_CAM_LCD_VA_HEIGHT_S)
#define LCD_CAM_LCD_VA_HEIGHT_V  0x000003ff
#define LCD_CAM_LCD_VA_HEIGHT_S  11

/* LCD_CAM_LCD_HB_FRONT : R/W; bitpos: [10:0]; default: 0;
 * It is the horizontal blank front porch of a frame.
 */

#define LCD_CAM_LCD_HB_FRONT    0x000007ff
#define LCD_CAM_LCD_HB_FRONT_M  (LCD_CAM_LCD_HB_FRONT_V << LCD_CAM_LCD_HB_FRONT_S)
#define LCD_CAM_LCD_HB_FRONT_V  0x000007ff
#define LCD_CAM_LCD_HB_FRONT_S  0

/* LCD_CAM_LCD_CTRL1_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_CTRL1_REG (DR_REG_LCD_CAM_BASE + 0x20)

/* LCD_CAM_LCD_HT_WIDTH : R/W; bitpos: [31:20]; default: 0;
 * It is the horizontal total width of a frame.
 */

#define LCD_CAM_LCD_HT_WIDTH    0x00000fff
#define LCD_CAM_LCD_HT_WIDTH_M  (LCD_CAM_LCD_HT_WIDTH_V << LCD_CAM_LCD_HT_WIDTH_S)
#define LCD_CAM_LCD_HT_WIDTH_V  0x00000fff
#define LCD_CAM_LCD_HT_WIDTH_S  20

/* LCD_CAM_LCD_HA_WIDTH : R/W; bitpos: [19:8]; default: 0;
 * It is the horizontal active width of a frame.
 */

#define LCD_CAM_LCD_HA_WIDTH    0x00000fff
#define LCD_CAM_LCD_HA_WIDTH_M  (LCD_CAM_LCD_HA_WIDTH_V << LCD_CAM_LCD_HA_WIDTH_S)
#define LCD_CAM_LCD_HA_WIDTH_V  0x00000fff
#define LCD_CAM_LCD_HA_WIDTH_S  8

/* LCD_CAM_LCD_VB_FRONT : R/W; bitpos: [7:0]; default: 0;
 * It is the vertical blank front porch of a frame.
 */

#define LCD_CAM_LCD_VB_FRONT    0x000000ff
#define LCD_CAM_LCD_VB_FRONT_M  (LCD_CAM_LCD_VB_FRONT_V << LCD_CAM_LCD_VB_FRONT_S)
#define LCD_CAM_LCD_VB_FRONT_V  0x000000ff
#define LCD_CAM_LCD_VB_FRONT_S  0

/* LCD_CAM_LCD_CTRL2_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_CTRL2_REG (DR_REG_LCD_CAM_BASE + 0x24)

