apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/* LCD_CAM_LCD_HSYNC_POSITION : R/W; bitpos: [31:24]; default: 0;
 * It is the position of LCD_HSYNC active pulse in a line.
 */

#define LCD_CAM_LCD_HSYNC_POSITION    0x000000ff
#define LCD_CAM_LCD_HSYNC_POSITION_M  (LCD_CAM_LCD_HSYNC_POSITION_V << LCD_CAM_LCD_HSYNC_POSITION_S)
#define LCD_CAM_LCD_HSYNC_POSITION_V  0x000000ff
#define LCD_CAM_LCD_HSYNC_POSITION_S  24

/* LCD_CAM_LCD_HSYNC_IDLE_POL : R/W; bitpos: [23]; default: 0;
 * It is the idle value of LCD_HSYNC.
 */

#define LCD_CAM_LCD_HSYNC_IDLE_POL    (BIT(23))
#define LCD_CAM_LCD_HSYNC_IDLE_POL_M  (LCD_CAM_LCD_HSYNC_IDLE_POL_V << LCD_CAM_LCD_HSYNC_IDLE_POL_S)
#define LCD_CAM_LCD_HSYNC_IDLE_POL_V  0x00000001
#define LCD_CAM_LCD_HSYNC_IDLE_POL_S  23

/* LCD_CAM_LCD_HSYNC_WIDTH : R/W; bitpos: [22:16]; default: 1;
 * It is the position of LCD_HSYNC active pulse in a line.
 */

#define LCD_CAM_LCD_HSYNC_WIDTH    0x0000007f
#define LCD_CAM_LCD_HSYNC_WIDTH_M  (LCD_CAM_LCD_HSYNC_WIDTH_V << LCD_CAM_LCD_HSYNC_WIDTH_S)
#define LCD_CAM_LCD_HSYNC_WIDTH_V  0x0000007f
#define LCD_CAM_LCD_HSYNC_WIDTH_S  16

/* LCD_CAM_LCD_HS_BLANK_EN : R/W; bitpos: [9]; default: 0;
 * 1: The pulse of LCD_HSYNC is out in vertical blanking lines RGB mode. 0:
 * LCD_HSYNC pulse is valid only in active region lines in RGB mode.
 */

#define LCD_CAM_LCD_HS_BLANK_EN    (BIT(9))
#define LCD_CAM_LCD_HS_BLANK_EN_M  (LCD_CAM_LCD_HS_BLANK_EN_V << LCD_CAM_LCD_HS_BLANK_EN_S)
#define LCD_CAM_LCD_HS_BLANK_EN_V  0x00000001
#define LCD_CAM_LCD_HS_BLANK_EN_S  9

/* LCD_CAM_LCD_DE_IDLE_POL : R/W; bitpos: [8]; default: 0;
 * It is the idle value of LCD_DE.
 */

#define LCD_CAM_LCD_DE_IDLE_POL    (BIT(8))
#define LCD_CAM_LCD_DE_IDLE_POL_M  (LCD_CAM_LCD_DE_IDLE_POL_V << LCD_CAM_LCD_DE_IDLE_POL_S)
#define LCD_CAM_LCD_DE_IDLE_POL_V  0x00000001
#define LCD_CAM_LCD_DE_IDLE_POL_S  8

/* LCD_CAM_LCD_VSYNC_IDLE_POL : R/W; bitpos: [7]; default: 0;
 * It is the idle value of LCD_VSYNC.
 */

#define LCD_CAM_LCD_VSYNC_IDLE_POL    (BIT(7))
#define LCD_CAM_LCD_VSYNC_IDLE_POL_M  (LCD_CAM_LCD_VSYNC_IDLE_POL_V << LCD_CAM_LCD_VSYNC_IDLE_POL_S)
#define LCD_CAM_LCD_VSYNC_IDLE_POL_V  0x00000001
#define LCD_CAM_LCD_VSYNC_IDLE_POL_S  7

/* LCD_CAM_LCD_VSYNC_WIDTH : R/W; bitpos: [6:0]; default: 1;
 * It is the position of LCD_VSYNC active pulse in a line.
 */

#define LCD_CAM_LCD_VSYNC_WIDTH    0x0000007f
#define LCD_CAM_LCD_VSYNC_WIDTH_M  (LCD_CAM_LCD_VSYNC_WIDTH_V << LCD_CAM_LCD_VSYNC_WIDTH_S)
#define LCD_CAM_LCD_VSYNC_WIDTH_V  0x0000007f
#define LCD_CAM_LCD_VSYNC_WIDTH_S  0

/* LCD_CAM_LCD_CMD_VAL_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_CMD_VAL_REG (DR_REG_LCD_CAM_BASE + 0x28)

/* LCD_CAM_LCD_CMD_VALUE : R/W; bitpos: [31:0]; default: 0;
 * The LCD write command value.
 */

#define LCD_CAM_LCD_CMD_VALUE    0xffffffff
#define LCD_CAM_LCD_CMD_VALUE_M  (LCD_CAM_LCD_CMD_VALUE_V << LCD_CAM_LCD_CMD_VALUE_S)
#define LCD_CAM_LCD_CMD_VALUE_V  0xffffffff
#define LCD_CAM_LCD_CMD_VALUE_S  0

/* LCD_CAM_LCD_DLY_MODE_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_DLY_MODE_REG (DR_REG_LCD_CAM_BASE + 0x30)

/* LCD_CAM_LCD_VSYNC_MODE : R/W; bitpos: [7:6]; default: 0;
 * The output LCD_VSYNC is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_LCD_VSYNC_MODE    0x00000003
#define LCD_CAM_LCD_VSYNC_MODE_M  (LCD_CAM_LCD_VSYNC_MODE_V << LCD_CAM_LCD_VSYNC_MODE_S)
#define LCD_CAM_LCD_VSYNC_MODE_V  0x00000003
#define LCD_CAM_LCD_VSYNC_MODE_S  6

/* LCD_CAM_LCD_HSYNC_MODE : R/W; bitpos: [5:4]; default: 0;
 * The output LCD_HSYNC is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_LCD_HSYNC_MODE    0x00000003
#define LCD_CAM_LCD_HSYNC_MODE_M  (LCD_CAM_LCD_HSYNC_MODE_V << LCD_CAM_LCD_HSYNC_MODE_S)
#define LCD_CAM_LCD_HSYNC_MODE_V  0x00000003
#define LCD_CAM_LCD_HSYNC_MODE_S  4

/* LCD_CAM_LCD_DE_MODE : R/W; bitpos: [3:2]; default: 0;
 * The output LCD_DE is delayed by module clock LCD_CLK. 0: output without
 * delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the
 * negative edge of LCD_CLK.
 */

#define LCD_CAM_LCD_DE_MODE    0x00000003
#define LCD_CAM_LCD_DE_MODE_M  (LCD_CAM_LCD_DE_MODE_V << LCD_CAM_LCD_DE_MODE_S)
#define LCD_CAM_LCD_DE_MODE_V  0x00000003
#define LCD_CAM_LCD_DE_MODE_S  2

/* LCD_CAM_LCD_CD_MODE : R/W; bitpos: [1:0]; default: 0;
 * The output LCD_CD is delayed by module clock LCD_CLK. 0: output without
 * delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the
 * negative edge of LCD_CLK.
 */

#define LCD_CAM_LCD_CD_MODE    0x00000003
#define LCD_CAM_LCD_CD_MODE_M  (LCD_CAM_LCD_CD_MODE_V << LCD_CAM_LCD_CD_MODE_S)
#define LCD_CAM_LCD_CD_MODE_V  0x00000003
#define LCD_CAM_LCD_CD_MODE_S  0

/* LCD_CAM_LCD_DATA_DOUT_MODE_REG register
 * LCD configuration register
 */

#define LCD_CAM_LCD_DATA_DOUT_MODE_REG (DR_REG_LCD_CAM_BASE + 0x38)

/* LCD_CAM_DOUT15_MODE : R/W; bitpos: [31:30]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT15_MODE    0x00000003
#define LCD_CAM_DOUT15_MODE_M  (LCD_CAM_DOUT15_MODE_V << LCD_CAM_DOUT15_MODE_S)
#define LCD_CAM_DOUT15_MODE_V  0x00000003
#define LCD_CAM_DOUT15_MODE_S  30

/* LCD_CAM_DOUT14_MODE : R/W; bitpos: [29:28]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT14_MODE    0x00000003
#define LCD_CAM_DOUT14_MODE_M  (LCD_CAM_DOUT14_MODE_V << LCD_CAM_DOUT14_MODE_S)
#define LCD_CAM_DOUT14_MODE_V  0x00000003
#define LCD_CAM_DOUT14_MODE_S  28

/* LCD_CAM_DOUT13_MODE : R/W; bitpos: [27:26]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT13_MODE    0x00000003
#define LCD_CAM_DOUT13_MODE_M  (LCD_CAM_DOUT13_MODE_V << LCD_CAM_DOUT13_MODE_S)
#define LCD_CAM_DOUT13_MODE_V  0x00000003
#define LCD_CAM_DOUT13_MODE_S  26

/* LCD_CAM_DOUT12_MODE : R/W; bitpos: [25:24]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT12_MODE    0x00000003
#define LCD_CAM_DOUT12_MODE_M  (LCD_CAM_DOUT12_MODE_V << LCD_CAM_DOUT12_MODE_S)
#define LCD_CAM_DOUT12_MODE_V  0x00000003
#define LCD_CAM_DOUT12_MODE_S  24

/* LCD_CAM_DOUT11_MODE : R/W; bitpos: [23:22]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT11_MODE    0x00000003
#define LCD_CAM_DOUT11_MODE_M  (LCD_CAM_DOUT11_MODE_V << LCD_CAM_DOUT11_MODE_S)
#define LCD_CAM_DOUT11_MODE_V  0x00000003
#define LCD_CAM_DOUT11_MODE_S  22

/* LCD_CAM_DOUT10_MODE : R/W; bitpos: [21:20]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT10_MODE    0x00000003
#define LCD_CAM_DOUT10_MODE_M  (LCD_CAM_DOUT10_MODE_V << LCD_CAM_DOUT10_MODE_S)
#define LCD_CAM_DOUT10_MODE_V  0x00000003
#define LCD_CAM_DOUT10_MODE_S  20

/* LCD_CAM_DOUT9_MODE : R/W; bitpos: [19:18]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT9_MODE    0x00000003
#define LCD_CAM_DOUT9_MODE_M  (LCD_CAM_DOUT9_MODE_V << LCD_CAM_DOUT9_MODE_S)
#define LCD_CAM_DOUT9_MODE_V  0x00000003
#define LCD_CAM_DOUT9_MODE_S  18

