apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/* LCD_CAM_DOUT8_MODE : R/W; bitpos: [17:16]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT8_MODE    0x00000003
#define LCD_CAM_DOUT8_MODE_M  (LCD_CAM_DOUT8_MODE_V << LCD_CAM_DOUT8_MODE_S)
#define LCD_CAM_DOUT8_MODE_V  0x00000003
#define LCD_CAM_DOUT8_MODE_S  16

/* LCD_CAM_DOUT7_MODE : R/W; bitpos: [15:14]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT7_MODE    0x00000003
#define LCD_CAM_DOUT7_MODE_M  (LCD_CAM_DOUT7_MODE_V << LCD_CAM_DOUT7_MODE_S)
#define LCD_CAM_DOUT7_MODE_V  0x00000003
#define LCD_CAM_DOUT7_MODE_S  14

/* LCD_CAM_DOUT6_MODE : R/W; bitpos: [13:12]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT6_MODE    0x00000003
#define LCD_CAM_DOUT6_MODE_M  (LCD_CAM_DOUT6_MODE_V << LCD_CAM_DOUT6_MODE_S)
#define LCD_CAM_DOUT6_MODE_V  0x00000003
#define LCD_CAM_DOUT6_MODE_S  12

/* LCD_CAM_DOUT5_MODE : R/W; bitpos: [11:10]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT5_MODE    0x00000003
#define LCD_CAM_DOUT5_MODE_M  (LCD_CAM_DOUT5_MODE_V << LCD_CAM_DOUT5_MODE_S)
#define LCD_CAM_DOUT5_MODE_V  0x00000003
#define LCD_CAM_DOUT5_MODE_S  10

/* LCD_CAM_DOUT4_MODE : R/W; bitpos: [9:8]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT4_MODE    0x00000003
#define LCD_CAM_DOUT4_MODE_M  (LCD_CAM_DOUT4_MODE_V << LCD_CAM_DOUT4_MODE_S)
#define LCD_CAM_DOUT4_MODE_V  0x00000003
#define LCD_CAM_DOUT4_MODE_S  8

/* LCD_CAM_DOUT3_MODE : R/W; bitpos: [7:6]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT3_MODE    0x00000003
#define LCD_CAM_DOUT3_MODE_M  (LCD_CAM_DOUT3_MODE_V << LCD_CAM_DOUT3_MODE_S)
#define LCD_CAM_DOUT3_MODE_V  0x00000003
#define LCD_CAM_DOUT3_MODE_S  6

/* LCD_CAM_DOUT2_MODE : R/W; bitpos: [5:4]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT2_MODE    0x00000003
#define LCD_CAM_DOUT2_MODE_M  (LCD_CAM_DOUT2_MODE_V << LCD_CAM_DOUT2_MODE_S)
#define LCD_CAM_DOUT2_MODE_V  0x00000003
#define LCD_CAM_DOUT2_MODE_S  4

/* LCD_CAM_DOUT1_MODE : R/W; bitpos: [3:2]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT1_MODE    0x00000003
#define LCD_CAM_DOUT1_MODE_M  (LCD_CAM_DOUT1_MODE_V << LCD_CAM_DOUT1_MODE_S)
#define LCD_CAM_DOUT1_MODE_V  0x00000003
#define LCD_CAM_DOUT1_MODE_S  2

/* LCD_CAM_DOUT0_MODE : R/W; bitpos: [1:0]; default: 0;
 * The output data bit $n is delayed by module clock LCD_CLK. 0: output
 * without delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by
 * the negative edge of LCD_CLK.
 */

#define LCD_CAM_DOUT0_MODE    0x00000003
#define LCD_CAM_DOUT0_MODE_M  (LCD_CAM_DOUT0_MODE_V << LCD_CAM_DOUT0_MODE_S)
#define LCD_CAM_DOUT0_MODE_V  0x00000003
#define LCD_CAM_DOUT0_MODE_S  0

/* LCD_CAM_LC_DMA_INT_ENA_REG register
 * LCD_camera DMA inturrupt enable register
 */

#define LCD_CAM_LC_DMA_INT_ENA_REG (DR_REG_LCD_CAM_BASE + 0x64)

/* LCD_CAM_CAM_HS_INT_ENA : R/W; bitpos: [3]; default: 0;
 * The enable bit for Camera line interrupt.
 */

#define LCD_CAM_CAM_HS_INT_ENA    (BIT(3))
#define LCD_CAM_CAM_HS_INT_ENA_M  (LCD_CAM_CAM_HS_INT_ENA_V << LCD_CAM_CAM_HS_INT_ENA_S)
#define LCD_CAM_CAM_HS_INT_ENA_V  0x00000001
#define LCD_CAM_CAM_HS_INT_ENA_S  3

/* LCD_CAM_CAM_VSYNC_INT_ENA : R/W; bitpos: [2]; default: 0;
 * The enable bit for Camera frame end interrupt.
 */

#define LCD_CAM_CAM_VSYNC_INT_ENA    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_ENA_M  (LCD_CAM_CAM_VSYNC_INT_ENA_V << LCD_CAM_CAM_VSYNC_INT_ENA_S)
#define LCD_CAM_CAM_VSYNC_INT_ENA_V  0x00000001
#define LCD_CAM_CAM_VSYNC_INT_ENA_S  2

/* LCD_CAM_LCD_TRANS_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The enable bit for lcd transfer end interrupt.
 */

#define LCD_CAM_LCD_TRANS_DONE_INT_ENA    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA_M  (LCD_CAM_LCD_TRANS_DONE_INT_ENA_V << LCD_CAM_LCD_TRANS_DONE_INT_ENA_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA_V  0x00000001
#define LCD_CAM_LCD_TRANS_DONE_INT_ENA_S  1

/* LCD_CAM_LCD_VSYNC_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The enable bit for LCD frame end interrupt.
 */

#define LCD_CAM_LCD_VSYNC_INT_ENA    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_ENA_M  (LCD_CAM_LCD_VSYNC_INT_ENA_V << LCD_CAM_LCD_VSYNC_INT_ENA_S)
#define LCD_CAM_LCD_VSYNC_INT_ENA_V  0x00000001
#define LCD_CAM_LCD_VSYNC_INT_ENA_S  0

/* LCD_CAM_LC_DMA_INT_RAW_REG register
 * LCD_camera DMA raw inturrupt status register
 */

#define LCD_CAM_LC_DMA_INT_RAW_REG (DR_REG_LCD_CAM_BASE + 0x68)

/* LCD_CAM_CAM_HS_INT_RAW : RO; bitpos: [3]; default: 0;
 * The raw bit for Camera line interrupt.
 */

#define LCD_CAM_CAM_HS_INT_RAW    (BIT(3))
#define LCD_CAM_CAM_HS_INT_RAW_M  (LCD_CAM_CAM_HS_INT_RAW_V << LCD_CAM_CAM_HS_INT_RAW_S)
#define LCD_CAM_CAM_HS_INT_RAW_V  0x00000001
#define LCD_CAM_CAM_HS_INT_RAW_S  3

/* LCD_CAM_CAM_VSYNC_INT_RAW : RO; bitpos: [2]; default: 0;
 * The raw bit for Camera frame end interrupt.
 */

#define LCD_CAM_CAM_VSYNC_INT_RAW    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_RAW_M  (LCD_CAM_CAM_VSYNC_INT_RAW_V << LCD_CAM_CAM_VSYNC_INT_RAW_S)
#define LCD_CAM_CAM_VSYNC_INT_RAW_V  0x00000001
#define LCD_CAM_CAM_VSYNC_INT_RAW_S  2

/* LCD_CAM_LCD_TRANS_DONE_INT_RAW : RO; bitpos: [1]; default: 0;
 * The raw bit for lcd transfer end interrupt.
 */

#define LCD_CAM_LCD_TRANS_DONE_INT_RAW    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW_M  (LCD_CAM_LCD_TRANS_DONE_INT_RAW_V << LCD_CAM_LCD_TRANS_DONE_INT_RAW_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW_V  0x00000001
#define LCD_CAM_LCD_TRANS_DONE_INT_RAW_S  1

/* LCD_CAM_LCD_VSYNC_INT_RAW : RO; bitpos: [0]; default: 0;
 * The raw bit for LCD frame end interrupt.
 */

#define LCD_CAM_LCD_VSYNC_INT_RAW    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_RAW_M  (LCD_CAM_LCD_VSYNC_INT_RAW_V << LCD_CAM_LCD_VSYNC_INT_RAW_S)
#define LCD_CAM_LCD_VSYNC_INT_RAW_V  0x00000001
#define LCD_CAM_LCD_VSYNC_INT_RAW_S  0

