apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_lcd_cam.h
/* LCD_CAM_LC_DMA_INT_ST_REG register
 * LCD_camera DMA masked inturrupt status register
 */

#define LCD_CAM_LC_DMA_INT_ST_REG (DR_REG_LCD_CAM_BASE + 0x6c)

/* LCD_CAM_CAM_HS_INT_ST : RO; bitpos: [3]; default: 0;
 * The status bit for Camera transfer end interrupt.
 */

#define LCD_CAM_CAM_HS_INT_ST    (BIT(3))
#define LCD_CAM_CAM_HS_INT_ST_M  (LCD_CAM_CAM_HS_INT_ST_V << LCD_CAM_CAM_HS_INT_ST_S)
#define LCD_CAM_CAM_HS_INT_ST_V  0x00000001
#define LCD_CAM_CAM_HS_INT_ST_S  3

/* LCD_CAM_CAM_VSYNC_INT_ST : RO; bitpos: [2]; default: 0;
 * The status bit for Camera frame end interrupt.
 */

#define LCD_CAM_CAM_VSYNC_INT_ST    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_ST_M  (LCD_CAM_CAM_VSYNC_INT_ST_V << LCD_CAM_CAM_VSYNC_INT_ST_S)
#define LCD_CAM_CAM_VSYNC_INT_ST_V  0x00000001
#define LCD_CAM_CAM_VSYNC_INT_ST_S  2

/* LCD_CAM_LCD_TRANS_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 * The status bit for lcd transfer end interrupt.
 */

#define LCD_CAM_LCD_TRANS_DONE_INT_ST    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_ST_M  (LCD_CAM_LCD_TRANS_DONE_INT_ST_V << LCD_CAM_LCD_TRANS_DONE_INT_ST_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_ST_V  0x00000001
#define LCD_CAM_LCD_TRANS_DONE_INT_ST_S  1

/* LCD_CAM_LCD_VSYNC_INT_ST : RO; bitpos: [0]; default: 0;
 * The status bit for LCD frame end interrupt.
 */

#define LCD_CAM_LCD_VSYNC_INT_ST    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_ST_M  (LCD_CAM_LCD_VSYNC_INT_ST_V << LCD_CAM_LCD_VSYNC_INT_ST_S)
#define LCD_CAM_LCD_VSYNC_INT_ST_V  0x00000001
#define LCD_CAM_LCD_VSYNC_INT_ST_S  0

/* LCD_CAM_LC_DMA_INT_CLR_REG register
 * LCD_camera DMA inturrupt clear register
 */

#define LCD_CAM_LC_DMA_INT_CLR_REG (DR_REG_LCD_CAM_BASE + 0x70)

/* LCD_CAM_CAM_HS_INT_CLR : WO; bitpos: [3]; default: 0;
 * The clear bit for Camera line interrupt.
 */

#define LCD_CAM_CAM_HS_INT_CLR    (BIT(3))
#define LCD_CAM_CAM_HS_INT_CLR_M  (LCD_CAM_CAM_HS_INT_CLR_V << LCD_CAM_CAM_HS_INT_CLR_S)
#define LCD_CAM_CAM_HS_INT_CLR_V  0x00000001
#define LCD_CAM_CAM_HS_INT_CLR_S  3

/* LCD_CAM_CAM_VSYNC_INT_CLR : WO; bitpos: [2]; default: 0;
 * The clear bit for Camera frame end interrupt.
 */

#define LCD_CAM_CAM_VSYNC_INT_CLR    (BIT(2))
#define LCD_CAM_CAM_VSYNC_INT_CLR_M  (LCD_CAM_CAM_VSYNC_INT_CLR_V << LCD_CAM_CAM_VSYNC_INT_CLR_S)
#define LCD_CAM_CAM_VSYNC_INT_CLR_V  0x00000001
#define LCD_CAM_CAM_VSYNC_INT_CLR_S  2

/* LCD_CAM_LCD_TRANS_DONE_INT_CLR : WO; bitpos: [1]; default: 0;
 * The clear bit for lcd transfer end interrupt.
 */

#define LCD_CAM_LCD_TRANS_DONE_INT_CLR    (BIT(1))
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR_M  (LCD_CAM_LCD_TRANS_DONE_INT_CLR_V << LCD_CAM_LCD_TRANS_DONE_INT_CLR_S)
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR_V  0x00000001
#define LCD_CAM_LCD_TRANS_DONE_INT_CLR_S  1

/* LCD_CAM_LCD_VSYNC_INT_CLR : WO; bitpos: [0]; default: 0;
 * The clear bit for LCD frame end interrupt.
 */

#define LCD_CAM_LCD_VSYNC_INT_CLR    (BIT(0))
#define LCD_CAM_LCD_VSYNC_INT_CLR_M  (LCD_CAM_LCD_VSYNC_INT_CLR_V << LCD_CAM_LCD_VSYNC_INT_CLR_S)
#define LCD_CAM_LCD_VSYNC_INT_CLR_V  0x00000001
#define LCD_CAM_LCD_VSYNC_INT_CLR_S  0

/* LCD_CAM_LC_REG_DATE_REG register
 * Version register
 */

#define LCD_CAM_LC_REG_DATE_REG (DR_REG_LCD_CAM_BASE + 0xfc)

/* LCD_CAM_LC_DATE : R/W; bitpos: [27:0]; default: 33566752;
 * LCD_CAM version control register
 */

#define LCD_CAM_LC_DATE    0x0fffffff
#define LCD_CAM_LC_DATE_M  (LCD_CAM_LC_DATE_V << LCD_CAM_LC_DATE_S)
#define LCD_CAM_LC_DATE_V  0x0fffffff
#define LCD_CAM_LC_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_LCD_CAM_H */
